create database CityFast
go
use CityFast
go
Create table ƒиспетчеры (
	idƒисп int primary key NOT NULL IDENTITY(1,1),
	фиоƒисп nvarchar(50) NOT NULL ,
	телƒисп nvarchar(50) NOT NULL,
	парольƒисп nvarchar(50) NOT NULL,
	токенƒисп nvarchar(20) NOT NULL
)
go
Create table  лиенты (
	id л int primary key NOT NULL IDENTITY(1,1),
	фио л nvarchar(50) NOT NULL ,
	тел л nvarchar(50) NOT NULL,
	пароль л nvarchar(50) NOT NULL,
	токен л nvarchar(20) NOT NULL
)
go
Create table ¬одители (
	id¬одит int primary key NOT NULL IDENTITY(1,1),
	фио¬одит nvarchar(50) NOT NULL,
	тел¬одит nvarchar(50) NOT NULL,
	пароль¬одит nvarchar(50) NOT NULL,
	токен¬одит nvarchar(20) NOT NULL,
	маркајвто nvarchar(50) NOT NULL,
	номерјвто nvarchar(50) NOT NULL
)
go
create table «аказы (
	id«аказа int primary key NOT NULL IDENTITY(1,1),
	срочный«аказ bit NOT NULL,
	врем€ѕриезда time(7) NULL,
	улицаќт nvarchar(50) NOT NULL,
	домќт nvarchar(50) NOT NULL,
	подъездќт nvarchar(50) NULL,
	улицаƒо nvarchar(50) NOT NULL,
	домƒо nvarchar(50) NOT NULL,
	подъездƒо nvarchar(50) NULL,
	допјдрес bit NOT NULL,
	улицаƒоп nvarchar(50) NULL,
	домƒоп nvarchar(50) NULL,
	подъездƒоп nvarchar(50) NULL,
	перевозка∆ивотн bit NOT NULL,
	детск ресло bit NOT NULL,
	¬озраст–ебЄнка int NULL,
	некур—алон bit NOT NULL,
	стоимость int NOT NULL,
	idƒисп int NOT NULL,
	id л int NOT NULL,
	id¬одит int NOT NULL,
	статус bit NOT NULL,
	CONSTRAINT FK_idƒисп FOREIGN KEY (idƒисп) REFERENCES ƒиспетчеры(idƒисп),
	CONSTRAINT FK_id л FOREIGN KEY (id л) REFERENCES  лиенты(id л),
	CONSTRAINT FK_id¬одит FOREIGN KEY (id¬одит) REFERENCES ¬одители(id¬одит)
)
go
INSERT [dbo].[¬одители] ([фио¬одит], [тел¬одит], [пароль¬одит], [токен¬одит], [маркајвто], [номерјвто]) VALUES (N'јртЄмов ≈вгений ≈вгеньевич', N'+7(987)656-76-78', N'1314AEE', N'DBNVXFEGXVCGRHQ4YUY3', N'“ойота', N'у454ке')
INSERT [dbo].[¬одители] ([фио¬одит], [тел¬одит], [пароль¬одит], [токен¬одит], [маркајвто], [номерјвто]) VALUES (N' р€гин ѕавел ѕетрович', N'+7(966)633-66-33', N'Pav1345Pav', N'OVMGKPGR5KAP3DE41JXL', N'ћазда', N'х665ен')
INSERT [dbo].[¬одители] ([фио¬одит], [тел¬одит], [пароль¬одит], [токен¬одит], [маркајвто], [номерјвто]) VALUES (N' ратин јндрей ≈вгеньевич', N'+7(933)234-67-44', N'Andrew1989', N'BMXMHNV2D63UKDR5HY28', N'“ойота', N'р546ор')
INSERT [dbo].[¬одители] ([фио¬одит], [тел¬одит], [пароль¬одит], [токен¬одит], [маркајвто], [номерјвто]) VALUES (N'”рада ¬асилий »ванович', N'+7(903)739-88-34', N'UradaBI1970', N'G8XTUHSQWG3WC950F38I', N'Ћада', N'к663кк')
INSERT [dbo].[¬одители] ([фио¬одит], [тел¬одит], [пароль¬одит], [токен¬одит], [маркајвто], [номерјвто]) VALUES (N'ѕрохоров ¬ладимир Ќиколаевич', N'+7(977)554-77-33', N'1VladikSuper1', N'KR7MP57VPBIPK9C1M0QG', N'Ћада', N'н743не')
GO
INSERT [dbo].[ƒиспетчеры] ([фиоƒисп], [телƒисп], [парольƒисп], [токенƒисп]) VALUES (N' ерета »ван ¬ладимирович', N'+7(933)776-44-33', N'KV2000Ivan', N'HI9N46IKNJPIVZZXVR97')
INSERT [dbo].[ƒиспетчеры] ([фиоƒисп], [телƒисп], [парольƒисп], [токенƒисп]) VALUES (N'Ќарийский «ахар ѕавлович', N'+7(908)456-77-77', N'19Zakhar28', N'VQC519DYFBVT0CQN2DC5')
INSERT [dbo].[ƒиспетчеры] ([фиоƒисп], [телƒисп], [парольƒисп], [токенƒисп]) VALUES (N'’одаковский ¬ладимир —ергеевич ', N'+7(901)988-73-73', N'qazujm1928', N'M3S3RFIU2C31CEBK4UCD')
INSERT [dbo].[ƒиспетчеры] ([фиоƒисп], [телƒисп], [парольƒисп], [токенƒисп]) VALUES (N' урага јртЄм —ергеевич', N'+7(945)111-55-55', N'KuragaArtem', N'KSWZPV9CRF00SZGWN8Z0')
INSERT [dbo].[ƒиспетчеры] ([фиоƒисп], [телƒисп], [парольƒисп], [токенƒисп]) VALUES (N'√ромский —ергей ¬икторович', N'+7(901)435-66-77', N'SeregaGrom1223', N'37OLKGW46E02WN0WR0ED')
GO
INSERT [dbo].[ лиенты] ([фио л], [тел л], [пароль л], [токен л]) VALUES (N'≈вла ¬алентина —ергеевна', N'+7(907)662-54-87', N'20001712Valya', N'85PGHWZTCPBRF4OD7P93')
INSERT [dbo].[ лиенты] ([фио л], [тел л], [пароль л], [токен л]) VALUES (N' артин јндрей ƒенисович', N'+7(907)883-85-85', N'CartMAster', N'VMTB3M4ANUBEN65F9CT2')
INSERT [dbo].[ лиенты] ([фио л], [тел л], [пароль л], [токен л]) VALUES (N'‘илонска€ јнгелина ¬алентиновна', N'+7(988)116-77-75', N'1999Angel1999', N'HG1LGE8WWKRWF7Y0BPZF')
INSERT [dbo].[ лиенты] ([фио л], [тел л], [пароль л], [токен л]) VALUES (N'«инина јнна  онстантиновна', N'+7(954)774-65-99', N'mamaAnnathebest', N'FCEO9SUFDT2D00NL7FFR')
INSERT [dbo].[ лиенты] ([фио л], [тел л], [пароль л], [токен л]) VALUES (N'÷укер ƒенис јнтонович', N'+7(922)577-13-23', N'dd.den19801212', N'8AQMM56I3E3ONQE0PVWY')
go
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (1, NULL, N'ул. —аратовска€', N'43', N'2', N'ул. ƒольска€ ', N'2', NULL, 0, NULL, NULL, NULL, 0, 0, NULL, 1, 350, 2, 4, 2, 1)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (0, CAST(N'19:30:00' AS Time), N'пр. ћира', N'125', N'4', N'ул. «аборна€', N'13', N'2', 1, N'ул. «аездна€', N'34', N'2', 1, 0, NULL, 0, 600, 1, 2, 4, 0)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (1, NULL, N'пр. ћира', N'11', N'5', N'ул. ’имиков', N'2', N'4', 0, NULL, NULL, NULL, 1, 1, 12, 1, 250, 2, 1, 5, 0)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (0, CAST(N'19:30:00' AS Time), N'ул. Ќабережна€', N'1', N'', N'ул. ’имиков', N'3', N'', 0, NULL, NULL, NULL, 1, 1, 3, 1, 400, 4, 4, 4, 1)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (0, CAST(N'10:00:00' AS Time), N'ул.  ругова€', N'66', NULL, N'ул. 2-€ —еверна€', N'10', NULL, 1, N'ул.  вартирна€', N'2', N'3', 0, 0, NULL, 0, 600, 3, 3, 3, 1)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (0, NULL, N'ул. «аводска€', N'10', NULL, N'ул. 5-€ —еверна€', N'14', NULL, 0, NULL, NULL, NULL, 0, 1, 3, 1, 700, 2, 4, 2, 0)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (1, CAST(N'15:10:00' AS Time), N'ул. —редн€€', N'4', NULL, N'ул. 76-¬нутренн€€', N'54', NULL, 1, N'ул.  вартирна€', N'2', N'1', 0, 0, NULL, 0, 349, 5, 5, 1, 0)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (1, CAST(N'15:50:00' AS Time), N'ул. —редн€€', N'4', N'2', N'ул. ƒольна€', N'12', N'2', 0, NULL, NULL, NULL, 1, 0, NULL, 0, 270, 3, 4, 5, 1)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (0, NULL, N'пр. ”спешный', N'123', N'2', N'пр. ёжный', N'2', N'2', 0, NULL, NULL, NULL, 1, 1, 5, 1, 340, 2, 2, 2, 0)
INSERT [dbo].[«аказы] ([срочный«аказ], [врем€ѕриезда], [улицаќт], [домќт], [подъездќт], [улицаƒо], [домƒо], [подъездƒо], [допјдрес], [улицаƒоп], [домƒоп], [подъездƒоп], [перевозка∆ивотн], [детск ресло], [¬озраст–ебЄнка], [некур—алон], [—тоимость], [idƒисп], [id л], [id¬одит], [статус]) VALUES (0, NULL, N'ул. «аездна€', N'22', N'2', N'ул.  вартирна€', N'4', N'2', 1, N'пр. ћира', N'5', N'4', 1, 0, NULL, 1, 980, 1, 1, 5, 1)
GO

use CityFast
CREATE ROLE operators
GO
CREATE ROLE drivers
GO
CREATE ROLE clients
GO
use CityFast
revoke select from public
grant select to operators
grant insert on [dbo].[«аказы] to operators
grant update on [dbo].[«аказы] to operators
grant select on [dbo].[¬одители] to drivers
grant select on [dbo].[ лиенты] to clients
grant select on [dbo].[«аказы] to drivers, clients
go
use CityFast
create login Client2 with password = 'Client123!!'
create login Operator2 with password = 'Operator123!!'
create login Driver2 with password = 'Driver123!!'
go
use CityFast
CREATE USER [Operator] FOR LOGIN [Operator2] 
GO
CREATE USER [Driver] FOR LOGIN [Driver2]
GO
CREATE USER [Client] FOR LOGIN [Client2] 
GO

go
use CityFast
EXEC sp_addrolemember @rolename = 'clients', @membername = 'Client'
EXEC sp_addrolemember @rolename = 'drivers', @membername = 'Driver'
EXEC sp_addrolemember @rolename = 'operators', @membername = 'Operator'